[
  {
    "name": "Wake",
    "description": "A camisa Wake da 4TEX combina conforto e estilo para o seu dia a dia. Feita com materiais de alta qualidade, proporciona um ajuste perfeito e toque suave na pele. Com um design moderno e versátil, é ideal para diversas ocasiões. Leve e resistente, oferece durabilidade sem comprometer a leveza.",
    "picture": "https://i.imgur.com/cE023cX.jpeg",
    "type": "Camisa",
    "brand": "4TEX",
    "quantity": 92,
    "price": 27.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "Werton",
    "description": "A camisa Werton da 4TEX combina modernidade, conforto e durabilidade em um só produto. Fabricada com tecido de alta qualidade, oferece um toque suave e um caimento impecável, garantindo liberdade de movimento e bem-estar ao longo do dia. Seu design versátil se adapta perfeitamente a diferentes ocasiões, desde encontros casuais até momentos mais formais. Leve e resistente, é uma escolha ideal para quem busca estilo sem abrir mão do conforto.",
    "picture": "https://i.imgur.com/wcNa7Zn.jpeg",
    "type": "Camisa",
    "brand": "4TEX",
    "quantity": 89,
    "price": 27.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "Plofrom",
    "description": "A camisa Plofrom da 4TEX combina conforto e estilo para o seu dia a dia. Feita com materiais de alta qualidade, proporciona um ajuste perfeito e toque suave na pele. Com um design moderno e versátil, é ideal para diversas ocasiões. Leve e resistente, oferece durabilidade sem comprometer a leveza.",
    "picture": "https://i.imgur.com/w0G5ryX.jpeg",
    "type": "Camisa",
    "brand": "4TEX",
    "quantity": 81,
    "price": 27.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "Vengeance",
    "description": "A camisa Vengeance da FOCO une estilo e conforto em um design moderno e versátil. Confeccionada com tecido de alta qualidade, oferece um caimento leve e toque suave para o máximo de conforto no dia a dia. Ideal para diversas ocasiões, desde momentos casuais até combinações mais sofisticadas. Resistente e durável, mantém sua aparência impecável por mais tempo.",
    "picture": "https://i.imgur.com/xPxMW9p.jpeg",
    "type": "Camisa",
    "brand": "FOCO",
    "quantity": 170,
    "price": 32.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "Siters",
    "description": "A camisa Siters da FOCO é a combinação perfeita de estilo, conforto e qualidade. Produzida com tecido premium, oferece um toque macio e um caimento impecável para o máximo de conforto no dia a dia. Seu design versátil permite combinações para diversas ocasiões, desde looks casuais até produções mais sofisticadas. Leve e resistente, garante durabilidade sem perder a elegância.",
    "picture": "https://i.imgur.com/98ctr1j.jpeg",
    "type": "Camisa",
    "brand": "FOCO",
    "quantity": 143,
    "price": 32.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "AOT",
    "description": "A camisa AOT da Star é a escolha ideal para quem busca estilo e conforto em uma única peça. Fabricada com tecido premium, oferece um toque macio e um ajuste perfeito, proporcionando bem-estar durante todo o dia. Seu design moderno e versátil permite combinações para diversas ocasiões, desde encontros casuais até looks mais elaborados. Leve e resistente, é uma peça durável que mantém sua aparência impecável por muito mais tempo.",
    "picture": "https://i.imgur.com/AdBHGGP.jpeg",
    "type": "Camisa",
    "brand": "Star",
    "quantity": 288,
    "price": 22.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "Pacmonster",
    "description": "A camisa Pacmonster da Star combina autenticidade e conforto para quem busca um visual moderno e despojado. Confeccionada com tecido premium, proporciona um toque suave e um caimento impecável, garantindo conforto ao longo do dia. Seu design versátil permite combinações para diferentes ocasiões, desde momentos casuais até produções mais ousadas. Leve e resistente, mantém sua qualidade e estilo por muito mais tempo.",
    "picture": "https://i.imgur.com/cVelFwR.jpeg",
    "type": "Camisa",
    "brand": "Star",
    "quantity": 263,
    "price": 22.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "Gooiok",
    "description": "A camisa Gooiok da Star é a escolha perfeita para quem busca estilo e conforto em uma peça única. Produzida com tecido premium, proporciona um toque macio e um ajuste impecável, garantindo bem-estar durante todo o dia. Seu design moderno e versátil permite combinações para diversas ocasiões, desde encontros casuais até looks mais sofisticados. Leve e resistente, mantém sua durabilidade sem perder a elegância.",
    "picture": "https://i.imgur.com/0pCzKaZ.jpeg",
    "type": "Camisa",
    "brand": "Star",
    "quantity": 234,
    "price": 23.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "Sarnme",
    "description": "A camisa Sarnme da Star combina sofisticação e conforto em um design moderno e versátil. Produzida com tecido premium, oferece um toque macio e um ajuste perfeito para o máximo de conforto ao longo do dia. Seu estilo atemporal permite combinações para diversas ocasiões, desde encontros casuais até produções mais refinadas. Leve e resistente, mantém sua durabilidade sem perder a elegância.",
    "picture": "https://i.imgur.com/gJk0SpT.jpeg",
    "type": "Camisa",
    "brand": "Star",
    "quantity": 244,
    "price": 25.99,
    "width": 25,
    "height": 2,
    "length": 30,
    "weight": 0.2
  },
  {
    "name": "Space Ship",
    "description": "A caneca Space Ship da Pro é uma escolha divertida e estilosa para os amantes do universo espacial e fãs de ficção científica. Feita de cerâmica de alta qualidade, esta caneca traz um design único inspirado nas viagens intergalácticas, perfeita para bebidas quentes ou frias. Seu acabamento premium e a alça ergonômica garantem conforto durante o uso, tornando-a ideal para o dia a dia ou como presente para quem adora explorar o cosmos.",
    "picture": "https://i.imgur.com/oVvCgat.jpeg",
    "type": "Caneca",
    "brand": "Pro",
    "quantity": 140,
    "price": 17.99,
    "width": 8,
    "height": 10,
    "length": 8,
    "weight": 0.35
  },
  {
    "name": "Mr Robot",
    "description": "A caneca Mr Robot da Pro é a escolha perfeita para quem ama tecnologia e cultura geek. Feita de cerâmica de alta qualidade, essa caneca combina funcionalidade e estilo, trazendo um design exclusivo e moderno que reflete o espírito da série Mr. Robot. Ideal para bebidas quentes ou frias, sua alça ergonômica proporciona conforto ao segurar, enquanto seu acabamento premium garante durabilidade.",
    "picture": "https://i.imgur.com/iRGUWiA.jpeg",
    "type": "Caneca",
    "brand": "Pro",
    "quantity": 140,
    "price": 17.99,
    "width": 8,
    "height": 10,
    "length": 8,
    "weight": 0.35
  },
  {
    "name": "Future",
    "description": "O relógio Future da Pointer é uma peça elegante e moderna, projetada para quem busca sofisticação e funcionalidade. Com um design futurista, este relógio combina precisão e estilo, ideal para todas as ocasiões. Sua estrutura resistente e acabamento de alta qualidade garantem durabilidade e conforto, enquanto o visor claro facilita a leitura da hora. Seja para complementar seu visual diário ou para um presente especial, o Relógio Future é a escolha perfeita para quem aprecia inovação e classe.",
    "picture": "https://i.imgur.com/9hxbgY3.jpeg",
    "type": "Relogio",
    "brand": "Pointer",
    "quantity": 92,
    "price": 54.99,
    "width": 10,
    "height": 12,
    "length": 10,
    "weight": 0.4
  },
  {
    "name": "Techno",
    "description": "O relógio Techno da Pointer é a fusão perfeita entre modernidade e elegância, projetado para quem valoriza sofisticação e funcionalidade em um único acessório. Com um design futurista que chama a atenção, este relógio é ideal para quem busca um estilo único e contemporâneo, capaz de complementar qualquer visual, seja no dia a dia ou em ocasiões especiais.",
    "picture": "https://i.imgur.com/PpMa3hh.jpeg",
    "type": "Relogio",
    "brand": "Pointer",
    "quantity": 92,
    "price": 80.99,
    "width": 10,
    "height": 12,
    "length": 10,
    "weight": 0.4
  },
  {
    "name": "Frozen",
    "description": "O boné Frozen da V7BOX é a escolha ideal para quem busca unir estilo, conforto e modernidade em um acessório versátil. Com um design contemporâneo e um toque de sofisticação, este boné é perfeito para complementar looks casuais ou esportivos, garantindo um visual único e cheio de personalidade.",
    "picture": "https://i.imgur.com/pxzPmrB.jpeg",
    "type": "Bone",
    "brand": "V7BOX",
    "quantity": 160,
    "price": 42.99,
    "width": 22,
    "height": 10,
    "length": 28,
    "weight": 0.15
  },
  {
    "name": "GAR",
    "description": "O boné GAR da V7BOX é o acessório perfeito para quem busca um visual descolado e ao mesmo tempo confortável. Com seu design moderno e detalhado, este boné traz um toque de personalidade ao seu look, seja para o dia a dia ou para atividades ao ar livre. A qualidade dos materiais garante durabilidade e resistência, enquanto a aba curvada e o ajuste perfeito oferecem conforto durante todo o uso.",
    "picture": "https://i.imgur.com/EUM5jVm.jpeg",
    "type": "Bone",
    "brand": "V7BOX",
    "quantity": 187,
    "price": 42.99,
    "width": 22,
    "height": 10,
    "length": 28,
    "weight": 0.15
  },
  {
    "name": "GG",
    "description": "O boné GG da Atitude é a escolha ideal para quem procura um acessório que combina estilo urbano e conforto. Com um design robusto e moderno, este boné é perfeito para adicionar um toque de ousadia ao seu visual. Feito com materiais de alta qualidade, oferece um ajuste confortável e durável, ideal para o uso diário.",
    "picture": "https://i.imgur.com/ZbeSafU.jpeg",
    "type": "Bone",
    "brand": "Atitude",
    "quantity": 151,
    "price": 36.99,
    "width": 22,
    "height": 10,
    "length": 28,
    "weight": 0.15
  },
  {
    "name": "Oxygen",
    "description": "O boné Oxygen da Atitude é a escolha perfeita para quem busca unir conforto e estilo em um acessório único. Com um design clean e moderno, este boné proporciona um ajuste confortável e perfeito para o dia a dia. Sua construção de alta qualidade garante durabilidade, enquanto o visual sofisticado e discreto o torna ideal para qualquer look.",
    "picture": "https://i.imgur.com/eHejstr.jpg",
    "type": "Bone",
    "brand": "Atitude",
    "quantity": 127,
    "price": 33.99,
    "width": 22,
    "height": 10,
    "length": 28,
    "weight": 0.15
  },
  {
    "name": "Heart",
    "description": "As meias Heart da Volte são a combinação perfeita entre conforto, estilo e qualidade, ideal para quem busca peças que unam praticidade e design em seu dia a dia. Com um toque delicado e moderno, estas meias são perfeitas para complementar looks casuais, esportivos ou até mesmo mais elaborados, garantindo um visual cheio de personalidade.",
    "picture": "https://i.imgur.com/y0snYWU.jpeg",
    "type": "Meia",
    "brand": "Volte",
    "quantity": 134,
    "price": 13.99,
    "width": 15,
    "height": 5,
    "length": 20,
    "weight": 0.2
  },
  {
    "name": "Losango",
    "description": "As meias Losango da Volte são a escolha ideal para quem busca unir conforto, estilo e sofisticação em um acessório essencial do dia a dia. Com um design moderno e cheio de personalidade, estas meias apresentam um padrão de losangos que adiciona um toque de elegância e originalidade a qualquer look.",
    "picture": "https://i.imgur.com/l9Ly0VL.jpeg",
    "type": "Meia",
    "brand": "Volte",
    "quantity": 159,
    "price": 15.99,
    "width": 15,
    "height": 5,
    "length": 20,
    "weight": 0.2
  },
  {
    "name": "Ice",
    "description": "As meias Ice da Minority são a escolha perfeita para quem busca combinar conforto, estilo e um toque de modernidade em um acessório essencial. Com um design conciso e sofisticado, estas meias trazem um visual autêntico que se adapta perfeitamente a qualquer ocasião, seja no dia a dia, no trabalho ou em momentos de lazer.",
    "picture": "https://i.imgur.com/0VIFNgd.jpeg",
    "type": "Meia",
    "brand": "Minority",
    "quantity": 63,
    "price": 14.99,
    "width": 15,
    "height": 5,
    "length": 20,
    "weight": 0.2
  },
  {
    "name": "Forest",
    "description": "As meias Forest da Minority são para quem ousa ser diferente e busca um acessório que combine conforto, qualidade e um estilo verdadeiramente excêntrico. Inspiradas na riqueza e diversidade das florestas, estas meias trazem estampas vibrantes e cheias de personalidade, perfeitas para quem quer adicionar um toque ousado e único ao seu visual.",
    "picture": "https://i.imgur.com/KGxylmu.jpg",
    "type": "Meia",
    "brand": "Minority",
    "quantity": 214,
    "price": 14.99,
    "width": 15,
    "height": 5,
    "length": 20,
    "weight": 0.2
  },
  {
    "name": "Winter",
    "description": "As meias Winter da Autêntica são a escolha perfeita para quem busca um acessório que combine elegância atemporal, conforto e versatilidade. Com um visual clássico em preto e branco, estas meias trazem um design sofisticado que se adapta a qualquer ocasião, seja no inverno ou em dias mais frescos, garantindo um toque de estilo discreto e refinado ao seu visual.",
    "picture": "https://i.imgur.com/u1Noa8c.jpg",
    "type": "Meia",
    "brand": "Autentica",
    "quantity": 224,
    "price": 14.99,
    "width": 15,
    "height": 5,
    "length": 20,
    "weight": 0.2
  },
  {
    "name": "Red'n Yellow",
    "description": "As meias Red'n Yellow da Autêntica são a escolha ideal para quem busca um acessório cheio de energia, personalidade e um toque de ousadia. Com um visual vibrante que combina vermelho e amarelo, estas meias trazem um design alegre e cheio de vida, perfeito para quem quer adicionar um pop de cor e animação ao seu visual.",
    "picture": "https://i.imgur.com/181fNFs.jpg",
    "type": "Meia",
    "brand": "Autentica",
    "quantity": 212,
    "price": 14.99,
    "width": 15,
    "height": 5,
    "length": 20,
    "weight": 0.2
  },
  {
    "name": "MMV",
    "description": "As meias MMV da Autêntica são a escolha perfeita para quem busca um acessório que combine sofisticação e um toque de ousadia. Com um fundo preto elegante e detalhes em losangos vibrantes de vermelho, azul e amarelo, estas meias trazem um design moderno e cheio de personalidade, ideal para quem quer adicionar um contraste de cores ao visual sem perder a classe.",
    "picture": "https://i.imgur.com/V8UxhcX.jpg",
    "type": "Meia",
    "brand": "Autentica",
    "quantity": 46,
    "price": 14.99,
    "width": 15,
    "height": 5,
    "length": 20,
    "weight": 0.2
  },
  {
    "name": "Gruub",
    "description": "As meias Gruub da Autêntica são a escolha ideal para quem busca um acessório divertido, cheio de personalidade e um toque de humor. Com um vibrante tom de laranja e o adorável monstrinho Gruub estampado, estas meias trazem um design único e descontraído, perfeito para quem gosta de peças que contam uma história e expressam alegria no dia a dia.",
    "picture": "https://i.imgur.com/uJ1NwMV.jpg",
    "type": "Meia",
    "brand": "Autentica",
    "quantity": 120,
    "price": 9.99,
    "width": 15,
    "height": 5,
    "length": 20,
    "weight": 0.2
  }
]