Repository: dimaggessi/Geek-Store
Catalog: src/GeekStore.Domain/Shared/ResourceErrorMessages.*.resx
Languages: pt_br

# EMPTY_PRODUCT_NAME
source: Product name is required.
pt_br: É necessário informar o nome do produto.

# EMPTY_PRODUCT_BRAND
source: Product brand is required.
pt_br: É necessário informar a marca do produto.

# EMPTY_PRODUCT_DESCRIPTION
source: Product description is required.
pt_br: É necessário informar a descrição do produto.

# EMPTY_PRODUCT_HEIGHT
source: Product height is required.
pt_br: É necessário informar a altura do produto.

# EMPTY_PRODUCT_LENGTH
source: Product length is required.
pt_br: É necessário informar o comprimento do produto.

# EMPTY_PRODUCT_PICTURE
source: Product picture is required.
pt_br: É necessário informar a imagem do produto.

# EMPTY_PRODUCT_PRICE
source: Product price is required.
pt_br: É necessário informar o preço do produto.

# EMPTY_PRODUCT_QUANTITY
source: Product quantity is required.
pt_br: É necessário informar a quantidade do produto.

# EMPTY_PRODUCT_TYPE
source: Product type is required.
pt_br: É necessário informar o tipo do produto.

# EMPTY_PRODUCT_WEIGHT
source: Product weight is required.
pt_br: É necessário informar o peso do produto.

# EMPTY_PRODUCT_WIDTH
source: Product width is required.
pt_br: É necessário informar a largura do produto.

# MAX_PRODUCT_NAME
source: Product name must not exceed 100 characters.
pt_br: O nome do produto não pode exceder 100 caracteres.

# MAX_PRODUCT_BRAND
source: Product brand must not exceed 100 characters.
pt_br: A marca do produto não pode exceder 100 caracteres.

# MAX_PRODUCT_DESCRIPTION
source: Product description must not exceed 300 characters.
pt_br: A descrição do produto não pode exceder 300 caracteres.

# MAX_PRODUCT_TYPE
source: Product type must not exceed 100 characters.
pt_br: O tipo do produto não pode exceder 100 caracteres.

# MIN_PRODUCT_PRICE
source: Price must be greater than zero.
pt_br: O preço do produto precisa ser positivo.

# MIN_PRODUCT_QUANTITY
source: Product quantity cannot be zero or negative.
pt_br: A quantidade do produto não pode ser zero ou negativa.

# MIN_PRODUCT_HEIGHT
source: Product height must be greater than zero.
pt_br: A altura do produto precisa ser maior que zero.

# MIN_PRODUCT_LENGTH
source: Product length must be greater than zero.
pt_br: O comprimento do produto deve ser um número positivo.

# MIN_PRODUCT_WEIGHT
source: Product weight must be greater than zero.
pt_br: O peso do produto precisa ser maior que zero.

# MIN_PRODUCT_WIDTH
source: Product width must be greater than zero.
pt_br: A largura do produto precisa ser maior que zero.

# EMPTY_PRODUCT_ID
source: Product Id is required.
pt_br: É necessário informar o Id do Produto

# ERROR_CREATE_PRODUCT
source: Something went wrong while creating the product!
pt_br: Ocorreu um erro enquanto o produto era criado.

# DEFAULT_ERROR
source: Error.
pt_br: Erro.

# DEFAULT_NOT_FOUND
source: Not found.
pt_br: Não encontrado.

# PRODUCT_NOT_FOUND
source: Product was not found.
pt_br: Produto não encontrado.

# ERROR_REMOVE_PRODUCT
source: Unable to remove product.
pt_br: Não foi possível remover o produto.

# ERROR_UPDATE_PRODUCT
source: Unable to persist product in database.
pt_br: Não foi possível persistir o produto na base de dados.

# UNEXPECTED_ERROR
source: An unexpected error occurred.
pt_br: Ocorreu um erro inesperado.

# REQUEST_ERROR
source: An error occurred while processing your request.
pt_br: Ocorreu um erro ao tentar processar sua requisição.

source: Product Id and url mismatch.
pt_br: O ID do produto informado na url não corresponde ao informado na requisição.

# MIN_PAGE_INDEX
source: Page index must be greater than zero.
pt_br: PageIndex precisa ser maior que zero.

# REQUIRED_PAGE_INDEX
source: Page index is required.
pt_br: É necessário informar o PageIndex.

# INTERVAL_PAGE_SIZE
source: Page size must be between 1 and 10.
pt_br: PageSize precisa ser um número entre 1 e 10.

# SHOPPING_CART_ERROR
source: An error with shopping cart was happen.
pt_br: Ocorreu um erro com o carrinho de compras.

# EMPTY_SHOPPING_CART_ID
source: Shopping cart Id is required.
pt_br: O Id do carrinho de compras deve ser informado.

# REMOVE_ERROR
source: Error while removing from database.
pt_br: Um erro ocorreu ao tentar remover do banco de dados.

# GENERIC_SUCCESS_OPERATION
source: Successful operation.
pt_br: Operação realizada com successo.

# SHOPPING_CART_NULL
source: The given shopping cart cannot be null.
pt_br: O carrinho de compras não pode ser nulo.

# AUTH_USER_NOT_SIGNED_IN
source: User is not signed in.
pt_br: Usuário não está logado.

# AUTH_DEFAULT_ERROR
source: Authentication error.
pt_br: Erro de autenticação.

# AUTH_EMAIL_ALREADY_EXISTS
source: The given email already exists.
pt_br: Email informado já cadastrado.

# AUTH_UNEXPECTED_CREATE_USER_ERROR
source: An error occurred while attempt to create user.
pt_br: Ocorreu um erro ao tentar criar o usuário.

# AUTH_CREATE_USER_SUCCESS
source: User created with success.
pt_br: Usuário cadastrado com successo.

# AUTH_EMAIL_CLAIM_NOT_FOUND
source: Email claim not found.
pt_br: O atributo email não foi encontrado.

# AUTH_USER_NOT_FOUND
source: User not found.
pt_br: Usuário não foi encontrado.

# ADDRESS_CITY
source: City is required.
pt_br: Cidade deve ser informada.

# ADDRESS_CITY_MAX
source: City cannot exceed 50 characters.
pt_br: Cidade não deve exceder 50 caracteres.

# ADDRESS_COUNTRY
source: Country is required.
pt_br: País deve ser informado.

# ADDRESS_COUNTRY_MAX
source: Country cannot exceed 50 characters.
pt_br: País não deve exceder 50 caracteres.

# ADDRESS_NEIGHBORHOOD_MAX
source: Neighborhood cannot exceed 100 characters.
pt_br: Bairro não deve exceder 50 caracteres.

# ADDRESS_POSTAL_CODE
source: Postal Code is required.
pt_br: CEP deve ser informado.

# ADDRESS_POSTAL_CODE_MAX
source: Postal Code cannot exceed 20 characters.
pt_br: CEP não deve exceder 20 caracteres.

# ADDRESS_STATE
source: State is required.
pt_br: Estado deve ser informado.

# ADDRESS_STATE_MAX
source: State cannot exceed 50 characters.
pt_br: Estado não deve exceder 50 caracteres.

# ADDRESS_STREET
source: Street is required.
pt_br: Rua deve ser informada.

# ADDRESS_STREET_MAX
source: Street cannot exceed 100 characters
pt_br: Rua não deve exceder 100 caracteres.

# ADDRESS_ERROR
source: Problem while setting user address.
pt_br: Problema ao configurar o endereço do usuário.

source: Cart not found.
pt_br: Carrinho não encontrado.

# EMPTY_POSTAL_CODE
source: Postal Code is required.
pt_br: O CEP deve ser informado.

# VALID_POSTAL_CODE
source: Postal Code must be valid with exactly 8 numeric digits.
pt_br: O CEP deve conter exatamente 8 dígitos numéricos, sem hífen.

# EMPTY_DELIVERY_METHOD_ID
source: Delivery Method ID is required.
pt_br: O campo Id do método de entrega deve ser informado.

# EMPTY_PRODUCT_LIST
source: The list of products must contain at least one product, cannot be empty.
pt_br: A lista de produtos não pode estar vazia, precisa conter ao menos um produto.

# ERROR_DELIVERY_METHODS_NOT_FOUND
source: An error occurred while trying to get delivery methods.
pt_br: Ocorreu um erro na requisição para obter os métodos de entrega.

# ERROR_PICTURE_URL
source: Picture must be a valid URI.
pt_br: A imagem deve conter uma URL válida.

# EMPTY_PAYMENT_INTENT_ID
source: No payment intent was found for this order.
pt_br: Ausência do identificador do PaymentIntent. Nenhuma ordem de pagamento foi encontrada para esse pedido. Tente novamente mais tarde.

# ERROR_DELIVERY_METHOD_SELECT
source: No delivery method selected.
pt_br: Nenhum método de entrega foi selecionado.

# ERROR_GET_PRODUCT
source: Unable to get product item from the database.
pt_br: Não foi possível recuperar o item de produto do banco de dados.

# ERROR_ORDER_PERSIST
source: An unexpected error occurred while trying to persist order in database.
pt_br: Um erro inesperado aconteceu ao tentar persistir o pedido no banco de dados.

# ADDRESS_NULL
source: Address is required and cannot be null.
pt_br: O endereço deve ser informado.

# EMPTY_ADDRESS_NAME
source: Address name is required.
pt_br: O nome do endereço deve ser informado.

# EMPTY_CUSTOMER_EMAIL
source: Customer email is required.
pt_br: O email do cliente deve ser informado.

# EMPTY_PAYMENT_CARD_BRAND
source: Card brand is required.
pt_br: A bandeira do cartão é obrigatória.

# EMPTY_PAYMENT_CARD_LAST4
source: Card last four digits are required.
pt_br: Os últimos quatro digitos do cartão são obrigatórios.

# ERROR_EMAIL_INVALID
source: Email must be in a valid format email@provider
pt_br: O email deve estar em um formato válido "email@provedor".

# ERROR_INVALID_ID
source: Property Id must be greater than zero.
pt_br: A propriedade Id deve ser maior que zero.

# INVALID_CARD_BRAND
source: Card brand must have between 2 and 50 caracteres.
pt_br: A bandeira do cartão deve ter entre 2 e 50 caracteres.

# PAYMENT_SUMMARY_NOT_NULL
source: Payment Summary is required and cannot be null.
pt_br: O sumário do pagamento é obrigatório.

# INVALID_CARD_EXPMONTH
source: The card's month expiration date must be between 1 and 12.
pt_br: O mês de expiração do cartão deve estar entre 1 e 12.

# INVALID_CARD_YEAR
source: The card's expiration year must be the current year or greater.
pt_br: O ano de expiração do cartão deve ser o ano atual ou maior.

# ERROR_EMAIL_NOT_FOUND
source: User's email was not found. You must be logged in.
pt_br: O email do usuário não foi encontrado. Você deve estar autenticado para realizar essa operação.
